import projectIcon from '../images/industrial/project-icon.svg';
import infrastructureIcon from '../images/industrial/infrastructure-icon.svg';
import calculationsIcon from '../images/industrial/calculations-icon.svg';
import qaIcon from '../images/industrial/qa-icon.svg';
import ProjectBG from '../images/industrial/project.png';
import MachineLearningBg from '../images/industrial/machine-learning.png';
import DataBg from '../images/industrial/data.png';
import RobotBg from '../images/industrial/robot.png';
import popup1Img from '../images/popup/popup_1.png';

const industrialData = [
  {
    id: 1,
    title: 'Анализ социальных данных',
    icon: projectIcon,
    content:
      'Направление включает в себя исследования и разработки технологий МО и КТ',
    bg: ProjectBG,
    popupImg: popup1Img,
    webText: [
      {
        id: 1,
        type: 'p',
        text: 'Учебные лаборатории оснащены современным компьютерным оборудованием, техническими средствами защиты информации, программными и программно-аппаратными комплексами средств защиты, разработанными ведущими производителями: Positive Technologies, Infotecs, SearchInform, «Лаборатория ППШ» и других вендоров. Некоторые из лабораторных установок являются уникальными по своим исследовательским задачам.',
      },
      {
        id: 2,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 3,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 4,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    tabletText: [
      {
        id: 1,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 2,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 3,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    mobileText: [
      {
        id: 1,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 2,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
  },
  {
    id: 2,
    title: 'Инфраструктура больших данных',
    icon: infrastructureIcon,
    content:
      'Направление включает в себя исследования и разработки технологий МО и КТ',
    bg: MachineLearningBg,
    popupImg: popup1Img,
    webText: [
      {
        id: 1,
        type: 'p',
        text: 'Учебные лаборатории оснащены современным компьютерным оборудованием, техническими средствами защиты информации, программными и программно-аппаратными комплексами средств защиты, разработанными ведущими производителями: Positive Technologies, Infotecs, SearchInform, «Лаборатория ППШ» и других вендоров. Некоторые из лабораторных установок являются уникальными по своим исследовательским задачам.',
      },
      {
        id: 2,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 3,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 4,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    tabletText: [
      {
        id: 1,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 2,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 3,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    mobileText: [
      {
        id: 1,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 2,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
  },
  {
    id: 3,
    title: 'Облачные вычисления',
    icon: calculationsIcon,
    content:
      'Направление включает в себя исследования и разработки технологий МО и КТ',
    bg: DataBg,
    popupImg: popup1Img,
    webText: [
      {
        id: 1,
        type: 'p',
        text: 'Учебные лаборатории оснащены современным компьютерным оборудованием, техническими средствами защиты информации, программными и программно-аппаратными комплексами средств защиты, разработанными ведущими производителями: Positive Technologies, Infotecs, SearchInform, «Лаборатория ППШ» и других вендоров. Некоторые из лабораторных установок являются уникальными по своим исследовательским задачам.',
      },
      {
        id: 2,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 3,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 4,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    tabletText: [
      {
        id: 1,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 2,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 3,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    mobileText: [
      {
        id: 1,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 2,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
  },
  {
    id: 4,
    title: 'QA системы',
    icon: qaIcon,
    content:
      'Направление включает в себя исследования и разработки технологий МО и КТ',
    bg: RobotBg,
    popupImg: popup1Img,
    webText: [
      {
        id: 1,
        type: 'p',
        text: 'Учебные лаборатории оснащены современным компьютерным оборудованием, техническими средствами защиты информации, программными и программно-аппаратными комплексами средств защиты, разработанными ведущими производителями: Positive Technologies, Infotecs, SearchInform, «Лаборатория ППШ» и других вендоров. Некоторые из лабораторных установок являются уникальными по своим исследовательским задачам.',
      },
      {
        id: 2,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 3,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 4,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    tabletText: [
      {
        id: 1,
        type: 'p',
        text: 'Начиная с первого курса бакалавриата, студенты погружаются в область их будущей профессиональной деятельности, активно развивают навыки программирования, исследования защищенности информации в независимости от формы ее представления, проектирования комплексных интегрированных систем защиты информации, проходят различные виды практик.',
      },
      {
        id: 2,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 3,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
    mobileText: [
      {
        id: 1,
        type: 'p',
        text: 'В состав факультета входит ряд научных лабораторий и центров, в которых проводятся исследования:',
      },
      {
        id: 2,
        type: 'ul',
        children: [
          {
            id: 1,
            type: 'li',
            text: 'безопасные киберфизические системы;',
          },
          {
            id: 2,
            type: 'li',
            text: 'разработка средств защиты информации;',
          },
          {
            id: 3,
            type: 'li',
            text: 'функциональная безопасность беспилотных транспортных средств;',
          },
          {
            id: 4,
            type: 'li',
            text: 'теория информации и кодирования;',
          },
          {
            id: 5,
            type: 'li',
            text: 'информационные процессы в Интернет и безопасность виртуального пространства;',
          },
          {
            id: 6,
            type: 'li',
            text: 'интеллектуальные защищенные системы мультиагентного взаимодействия и пр.',
          },
        ],
      },
    ],
  },
];

export default industrialData;
